## 판다스는 heterogeneous(이질적인) 데이터들을 다루고 넘파이 같은건 homogeneous (동질적인) 데이터를 다룸

## 일단은 판다스를 알려면, 기본적으로 두 workhorse(기본 축)인 Series와 DataFrame에 대해서 꼭 알자 !!

## 시리즈(Series) 데이터

 - array - like 데이터임
 - sequence of values 담고 있음. 
 - array 로부터 fromed 된다!
 - index가 있다 !!!!!!! array랑 인덱스랑 같이있는 자료라고 보면 될듯

In [8]:
import pandas as pd
obj = pd.Series([4,7,-5,3])

In [9]:
# index on the left, values on the right
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
# values 보기
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [11]:
# index 보기
obj.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
# index를 생성하기도 가능!
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [25]:
# 그래서 index로 Series안의 값에 접근도 가능 - array와 다른 점이다!
obj2['a']

-5

In [26]:
obj2[['a','b','c']]

a   -5
b    7
c    3
dtype: int64

In [27]:
obj2['b'] = 100
obj2

d      4
b    100
a     -5
c      3
dtype: int64

In [34]:
# 이렇게 조건걸어서 찾기
obj2[obj2>3]

d      4
b    100
dtype: int64

In [35]:
# 연산들 적용도 가능
obj2 * 10

d      40
b    1000
a     -50
c      30
dtype: int64

### 시리즈는 
- index와 data값이 mapping 된 것
- 그럼 dict에서도 생성이 가능

In [41]:
# 딕셔너리에서 --> 시리즈로 . 이 떄 인덱스는 키값들임
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon' : 16000, 'Utah' : 5000}

In [42]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

 - 또는 이런식으로 인덱스 지정도 가능

In [54]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [55]:
obj4 = pd.Series(sdata, index=states)

In [59]:
# California가 NaN값이다 -  not a number / Utah는 sdata는 있어도 states에 없어서 불포함
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### null 값은 이렇게 확인!

In [61]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [62]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [64]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

## 시리즈는 name이라는 attribute가 있음. 인덱스 / 자료 각각의 이름이 있을 수 있음!

In [71]:
obj4.name = 'yo_population'
obj4.index.name = 'state_yo'

In [72]:
obj4

state_yo
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: yo_population, dtype: float64

In [73]:
# 인덱스 바꾸는 것도 가능
obj.index = ['California_yo', 'Ohio_yo', 'Oregon_yo', 'Texas_yo']

In [76]:
obj

California_yo    4
Ohio_yo          7
Oregon_yo       -5
Texas_yo         3
dtype: int64

## 두 번째 유형 -  데이터 프레임 (DataFrame)

In [119]:
# different type 데이터들이 특징

## Dataframe 을 생성하는 방법 (중 하나)

In [82]:
# 1) dict of equal-length lists or arrays 이용! 딕셔너리형태
data = {'state' :['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [83]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [84]:
# columns를 설정해줄 수 있다 - 
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [87]:
# 만약 처음 dict에 포함되지 않은 column을 넣으면 NaN값으로 채워진다 ! 
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index = ['one','two','three','four','five','six'])

In [88]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [93]:
# 두 가지 방법으로 column 불러올 수 있음  - Series로 불러옴
frame2['state']
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [96]:
# loc는 row를 검색한다 ! 
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [101]:
# assign values 
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [103]:
import numpy as np
frame2['debt'] = np.arange(len(frame2))
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [104]:
# Series를 끼워넣어보자
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val # 이러면 인덱스에 맞추어 들어가지고 나머진 NaN으로 남음
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

## 그럼 응용해서 이런거 가능 !

In [108]:
# 이건 시리즈로 나오니까,
type(frame2.state == 'Ohio')

pandas.core.series.Series

In [112]:
# 이렇게 시리즈를 할당하기 
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

## 지우기 del

In [113]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

## Nested dict : 중첩된 형태면? (리스트 안에 리스트 같은)

In [139]:
# 이렇게 dict 안에 dict 면 ? - 원래는 단일 기본 dict 가지고 dataframe 만들어왔음
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9},
      'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6}}

 - 정답 : interpret the outer dict keys --> as columns 
 - inner keys --> as the row indices(인덱스)

In [144]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [160]:
# 시리즈와 array는 다르다. 시리즈는 인덱스 있고 array는 없다. 시리즈는loc,iloc쓰지 않는 한 [:] 범위로 불러오고 array는 [1] 값으로 불러옴
pdata = {'Ohio' : frame3['Ohio'][:-1],
        'Nevada' : frame3['Nevada'][:2]}

In [161]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [162]:
# 아까처럼 index와 column에 name 주자 !
frame3.index.name = '년도!!'
frame3.columns.name = 'state!'

In [163]:
frame3

state!  Nevada  Ohio
년도!!
2001       2.4   1.7
2002       2.9   3.6
2000       NaN   1.5

In [165]:
#

#### values 라는 attribute는 two-dimensional ndarray를 반납한다

In [166]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [167]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [171]:
frame2.values.shape

(6, 4)